; domain
(define (domain logistics)
  (:requirements :typing :strips :numeric-fluents :action-costs)
  
  (:types
    place package vehicle - object
    city port airport - place
    truck airplane ship - vehicle
  )
  
  (:predicates
    (at-pkg ?p - package ?pl - place)
    (at-veh ?v - vehicle ?pl - place)
    (in ?pkg - package ?veh - vehicle)
    (link-road ?pl1 - place ?pl2 - place)
    (link-air ?a1 - airport ?a2 - airport)
    (link-water ?p1 - port ?p2 - port)
  )
  
  (:functions
    (total-cost)
    (cost-road ?pl1 - place ?pl2 - place)
    (cost-air ?a1 - airport ?a2 - airport)
    (cost-water ?p1 - port ?p2 - port)
    (load-cost)
    (unload-cost)
  )
  
  (:action load
    :parameters (?v - vehicle ?p - package ?pl - place)
    :precondition (and 
      (at-veh ?v ?pl) 
      (at-pkg ?p ?pl)
    )
    :effect (and 
      (not (at-pkg ?p ?pl)) 
      (in ?p ?v)
      (increase (total-cost) (load-cost))
    )
  )
  
  (:action unload
    :parameters (?v - vehicle ?p - package ?pl - place)
    :precondition (and 
      (at-veh ?v ?pl) 
      (in ?p ?v)
    )
    :effect (and 
      (not (in ?p ?v)) 
      (at-pkg ?p ?pl)
      (increase (total-cost) (unload-cost))
    )
  )
  
  (:action drive-truck
    :parameters (?t - truck ?pl1 - place ?pl2 - place)
    :precondition (and 
      (at-veh ?t ?pl1) 
      (link-road ?pl1 ?pl2)
    )
    :effect (and 
      (not (at-veh ?t ?pl1)) 
      (at-veh ?t ?pl2)
      (increase (total-cost) (cost-road ?pl1 ?pl2))
    )
  )
  
  (:action fly-airplane
    :parameters (?a - airplane ?a1 - airport ?a2 - airport)
    :precondition (and 
      (at-veh ?a ?a1) 
      (link-air ?a1 ?a2)
    )
    :effect (and 
      (not (at-veh ?a ?a1)) 
      (at-veh ?a ?a2)
      (increase (total-cost) (cost-air ?a1 ?a2))
    )
  )
  
  (:action sail-ship
    :parameters (?s - ship ?p1 - port ?p2 - port)
    :precondition (and 
      (at-veh ?s ?p1) 
      (link-water ?p1 ?p2)
    )
    :effect (and 
      (not (at-veh ?s ?p1)) 
      (at-veh ?s ?p2)
      (increase (total-cost) (cost-water ?p1 ?p2))
    )
  )
)

; problem
(define (problem transport-5-packages-advanced)
  (:domain logistics)
  
  (:objects
    Berlin Warszawa Gdansk Sztokholm Wroclaw Poznan - city
    PortGdansk PortSztokholm - port
    AirportBerlin AirportWarszawa AirportGdansk AirportSztokholm AirportWroclaw - airport
    p1 p2 p3 p4 p5 - package
    t1 t2 t3 t4 t5 t6 - truck
    a1 a2 - airplane
    s1 - ship
  )
  
  (:init
    (= (total-cost) 0)
    (= (load-cost) 5)
    (= (unload-cost) 5)

    (link-road Wroclaw Poznan) (link-road Poznan Wroclaw)
    (link-road Poznan Warszawa) (link-road Warszawa Poznan)
    (link-road Warszawa Gdansk) (link-road Gdansk Warszawa)
    (link-road Poznan Berlin) (link-road Berlin Poznan)
    (link-road Wroclaw Berlin) (link-road Berlin Wroclaw)

    (link-road Gdansk PortGdansk) (link-road PortGdansk Gdansk)
    (link-road Sztokholm PortSztokholm) (link-road PortSztokholm Sztokholm)
    (link-road Berlin AirportBerlin) (link-road AirportBerlin Berlin)
    (link-road Warszawa AirportWarszawa) (link-road AirportWarszawa Warszawa)
    (link-road Gdansk AirportGdansk) (link-road AirportGdansk Gdansk)
    (link-road Sztokholm AirportSztokholm) (link-road AirportSztokholm Sztokholm)
    (link-road Wroclaw AirportWroclaw) (link-road AirportWroclaw Wroclaw)

    (link-air AirportWarszawa AirportBerlin) (link-air AirportBerlin AirportWarszawa)
    (link-air AirportWarszawa AirportSztokholm) (link-air AirportSztokholm AirportWarszawa)
    (link-air AirportGdansk AirportWroclaw) (link-air AirportWroclaw AirportGdansk)

    (link-water PortGdansk PortSztokholm) (link-water PortSztokholm PortGdansk)

    (= (cost-road Wroclaw Poznan) 20) (= (cost-road Poznan Wroclaw) 20)
    (= (cost-road Poznan Warszawa) 30) (= (cost-road Warszawa Poznan) 30)
    (= (cost-road Warszawa Gdansk) 40) (= (cost-road Gdansk Warszawa) 40)
    (= (cost-road Poznan Berlin) 30) (= (cost-road Berlin Poznan) 30)
    (= (cost-road Wroclaw Berlin) 40) (= (cost-road Berlin Wroclaw) 40)

    (= (cost-road Gdansk PortGdansk) 5) (= (cost-road PortGdansk Gdansk) 5)
    (= (cost-road Sztokholm PortSztokholm) 5) (= (cost-road PortSztokholm Sztokholm) 5)
    (= (cost-road Berlin AirportBerlin) 5) (= (cost-road AirportBerlin Berlin) 5)
    (= (cost-road Warszawa AirportWarszawa) 5) (= (cost-road AirportWarszawa Warszawa) 5)
    (= (cost-road Gdansk AirportGdansk) 5) (= (cost-road AirportGdansk Gdansk) 5)
    (= (cost-road Sztokholm AirportSztokholm) 5) (= (cost-road AirportSztokholm Sztokholm) 5)
    (= (cost-road Wroclaw AirportWroclaw) 5) (= (cost-road AirportWroclaw Wroclaw) 5)

    (= (cost-air AirportWarszawa AirportBerlin) 150) (= (cost-air AirportBerlin AirportWarszawa) 150)
    (= (cost-air AirportWarszawa AirportSztokholm) 200) (= (cost-air AirportSztokholm AirportWarszawa) 200)
    (= (cost-air AirportGdansk AirportWroclaw) 180) (= (cost-air AirportWroclaw AirportGdansk) 180)

    (= (cost-water PortGdansk PortSztokholm) 50) (= (cost-water PortSztokholm PortGdansk) 50)

    (at-veh t1 Poznan) (at-veh t2 Warszawa) (at-veh t3 Sztokholm)
    (at-veh t4 Gdansk) (at-veh t5 Berlin) (at-veh t6 Wroclaw)
    (at-veh a1 AirportWarszawa) (at-veh a2 AirportGdansk)
    (at-veh s1 PortGdansk)

    (at-pkg p1 Wroclaw) (at-pkg p2 Berlin) (at-pkg p3 Warszawa)
    (at-pkg p4 Sztokholm) (at-pkg p5 Gdansk)
  )
  
  (:goal
    (and
      (at-pkg p1 Sztokholm)
      (at-pkg p2 Warszawa)
      (at-pkg p3 Berlin)
      (at-pkg p4 Wroclaw)
      (at-pkg p5 Poznan)
    )
  )
  
  (:metric minimize (total-cost))
)

; plan
1. (load t3 p4 sztokholm)
   deleted: (at-pkg p4 sztokholm)
   added: (in p4 t3)
   goals met: 0 of 5
2. (load t5 p2 berlin)
   deleted: (at-pkg p2 berlin)
   added: (in p2 t5)
   goals met: 0 of 5
3. (drive-truck t5 berlin poznan)
   deleted: (at-veh t5 berlin)
   added: (at-veh t5 poznan)
   goals met: 0 of 5
4. (drive-truck t5 poznan warszawa)
   deleted: (at-veh t5 poznan)
   added: (at-veh t5 warszawa)
   goals met: 0 of 5
5. (load t2 p3 warszawa)
   deleted: (at-pkg p3 warszawa)
   added: (in p3 t2)
   goals met: 0 of 5
6. (drive-truck t2 warszawa poznan)
   deleted: (at-veh t2 warszawa)
   added: (at-veh t2 poznan)
   goals met: 0 of 5
7. (drive-truck t2 poznan berlin)
   deleted: (at-veh t2 poznan)
   added: (at-veh t2 berlin)
   goals met: 0 of 5
8. (load t4 p5 gdansk)
   deleted: (at-pkg p5 gdansk)
   added: (in p5 t4)
   goals met: 0 of 5
9. (drive-truck t4 gdansk warszawa)
   deleted: (at-veh t4 gdansk)
   added: (at-veh t4 warszawa)
   goals met: 0 of 5
10. (drive-truck t4 warszawa poznan)
   deleted: (at-veh t4 warszawa)
   added: (at-veh t4 poznan)
   goals met: 0 of 5
11. (load t6 p1 wroclaw)
   deleted: (at-pkg p1 wroclaw)
   added: (in p1 t6)
   goals met: 0 of 5
12. (drive-truck t6 wroclaw poznan)
   deleted: (at-veh t6 wroclaw)
   added: (at-veh t6 poznan)
   goals met: 0 of 5
13. (drive-truck t6 poznan warszawa)
   deleted: (at-veh t6 poznan)
   added: (at-veh t6 warszawa)
   goals met: 0 of 5
14. (drive-truck t6 warszawa gdansk)
   deleted: (at-veh t6 warszawa)
   added: (at-veh t6 gdansk)
   goals met: 0 of 5
15. (drive-truck t3 sztokholm portsztokholm)
   deleted: (at-veh t3 sztokholm)
   added: (at-veh t3 portsztokholm)
   goals met: 0 of 5
16. (unload t3 p4 portsztokholm)
   deleted: (in p4 t3)
   added: (at-pkg p4 portsztokholm)
   goals met: 0 of 5
17. (unload t5 p2 warszawa)
   deleted: (in p2 t5)
   added: (at-pkg p2 warszawa)
   goals met: 1 of 5
18. (unload t4 p5 poznan)
   deleted: (in p5 t4)
   added: (at-pkg p5 poznan)
   goals met: 2 of 5
19. (unload t2 p3 berlin)
   deleted: (in p3 t2)
   added: (at-pkg p3 berlin)
   goals met: 3 of 5
20. (drive-truck t6 gdansk portgdansk)
   deleted: (at-veh t6 gdansk)
   added: (at-veh t6 portgdansk)
   goals met: 3 of 5
21. (unload t6 p1 portgdansk)
   deleted: (in p1 t6)
   added: (at-pkg p1 portgdansk)
   goals met: 3 of 5
22. (load s1 p1 portgdansk)
   deleted: (at-pkg p1 portgdansk)
   added: (in p1 s1)
   goals met: 3 of 5
23. (sail-ship s1 portgdansk portsztokholm)
   deleted: (at-veh s1 portgdansk)
   added: (at-veh s1 portsztokholm)
   goals met: 3 of 5
24. (load s1 p4 portsztokholm)
   deleted: (at-pkg p4 portsztokholm)
   added: (in p4 s1)
   goals met: 3 of 5
25. (unload s1 p1 portsztokholm)
   deleted: (in p1 s1)
   added: (at-pkg p1 portsztokholm)
   goals met: 3 of 5
26. (sail-ship s1 portsztokholm portgdansk)
   deleted: (at-veh s1 portsztokholm)
   added: (at-veh s1 portgdansk)
   goals met: 3 of 5
27. (unload s1 p4 portgdansk)
   deleted: (in p4 s1)
   added: (at-pkg p4 portgdansk)
   goals met: 3 of 5
28. (load t6 p4 portgdansk)
   deleted: (at-pkg p4 portgdansk)
   added: (in p4 t6)
   goals met: 3 of 5
29. (drive-truck t6 portgdansk gdansk)
   deleted: (at-veh t6 portgdansk)
   added: (at-veh t6 gdansk)
   goals met: 3 of 5
30. (drive-truck t6 gdansk warszawa)
   deleted: (at-veh t6 gdansk)
   added: (at-veh t6 warszawa)
   goals met: 3 of 5
31. (drive-truck t6 warszawa poznan)
   deleted: (at-veh t6 warszawa)
   added: (at-veh t6 poznan)
   goals met: 3 of 5
32. (drive-truck t6 poznan wroclaw)
   deleted: (at-veh t6 poznan)
   added: (at-veh t6 wroclaw)
   goals met: 3 of 5
33. (unload t6 p4 wroclaw)
   deleted: (in p4 t6)
   added: (at-pkg p4 wroclaw)
   goals met: 4 of 5
34. (load t3 p1 portsztokholm)
   deleted: (at-pkg p1 portsztokholm)
   added: (in p1 t3)
   goals met: 4 of 5
35. (drive-truck t3 portsztokholm sztokholm)
   deleted: (at-veh t3 portsztokholm)
   added: (at-veh t3 sztokholm)
   goals met: 4 of 5
36. (unload t3 p1 sztokholm)
   deleted: (in p1 t3)
   added: (at-pkg p1 sztokholm)
   goals met: 5 of 5
